Tekla Open API Reference for Tekla Structures 2025
PluginBase.InputDefinition Constructor (Point)
 Creates a new input definition instance with one point.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public InputDefinition(
	Point Point
)
Public Sub New (
	Point As Point
)
Parameters
Point
Type: Tekla.Structures.Geometry3d.Point
The point.
See Also
Reference
PluginBase.InputDefinition Class
PluginBase.InputDefinition Overload
Tekla.Structures.Plugins Namespace